Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Посещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияПосещений</xr:Item>
				<xr:Item>InformationRegister.ЗаданияТППоВнеплановымПосещениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПосещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПосещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийДень</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийДень</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельПосещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПосещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаданияТорговомуПредставителю</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостоянияПосещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПосещений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начато</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияТППоВнеплановымПосещениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТППоВнеплановымПосещениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалить_ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияПоАнкетированиюКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияПоАнкетированиюКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаАнкетирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияАнкетирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПосещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПосещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПлановоеПосещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеплановоеПосещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АнкетаТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АнкетаТП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыАнкетДляТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Территории</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ФБ_Базы</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Маршрут.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Маршрут</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальныеМаршруты</xr:Item>
				<xr:Item>InformationRegister.ЗаданияТП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПосещений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаданияТП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПосещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Посещение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.СостоянияПосещений.Записывать = Истина;
	
	Движение = Движения.СостоянияПосещений.Добавить();
	Движение.Период    = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Посещение = Ссылка;
	Движение.Начато    = Истина;
	Движение.Завершено = Завершено;
	
	Если ВидПосещения = Перечисления.ВидыПосещений.ТелефонныйЗвонок Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Цифра,
		|	""1"" КАК Строка
		|ПОМЕСТИТЬ Цифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	""2""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	""3""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	""4""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5,
		|	""5""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6,
		|	""6""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7,
		|	""7""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8,
		|	""8""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9,
		|	""9""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	""0""
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Цифра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотни.Цифра * 100 + Десятки.Цифра * 10 + Цифры.Цифра КАК Число,
		|	Сотни.Строка + Десятки.Строка + Цифры.Строка КАК Строка
		|ПОМЕСТИТЬ Числа
		|ИЗ
		|	Цифры КАК Сотни
		|		ПОЛНОЕ СОЕДИНЕНИЕ Цифры КАК Десятки
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ Цифры КАК Цифры
		|		ПО (ИСТИНА)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Число
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДокументПосещение КАК Посещение,
		|	&Контрагент КАК Контрагент,
		|	Числа.Строка КАК ИдентификаторЗадания,
		|	&ДокументМаршрут КАК Маршрут,
		|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания КАК ВидЗадания,
		|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания.Наименование КАК Задание,
		|
		|	ВЫБОР
		|		КОГДА (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных)
		|			ТОГДА &ШаблонАнкетыАктуализацияКонтактныхДанных
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)
		|	КОНЕЦ КАК ШаблонАнкеты,
		|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.Обязательное КАК Обязательное
		|ИЗ
		|	Справочник.ТипыПосещенийКлиентовТорговымиПредставителями.ЗаданияТорговомуПредставителю КАК ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю
		|		ЛЕВОЕ СОЕДИНЕНИЕ Числа КАК Числа
		|		ПО ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.НомерСтроки = Числа.Число
		|ГДЕ
		|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Числа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Цифры";
		
		Запрос.УстановитьПараметр("Ссылка", ОбщийМодульПовтИсп.ПолучитьТипПосещенияТелефонныйЗвонок() );
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ДокументПосещение", Ссылка);
		Запрос.УстановитьПараметр("ДокументМаршрут", Маршрут);
		
		Запрос.УстановитьПараметр("ВидЗаданияАктуализацияКонтактныхДанных", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных"));
		Запрос.УстановитьПараметр("ШаблонАнкетыАктуализацияКонтактныхДанных", ОбщийМодульПовтИсп.ШаблонАнкетыДляТППолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных"));
		
		Движения.ЗаданияТППоВнеплановымПосещениям.Загрузить(Запрос.Выполнить().Выгрузить());
		Движения.ЗаданияТППоВнеплановымПосещениям.Записывать = Истина;
		
	ИначеЕсли ВидПосещения = Перечисления.ВидыПосещений.ВнеплановоеПосещение Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Цифра,
		|	""1"" КАК Строка
		|ПОМЕСТИТЬ Цифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	""2""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	""3""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	""4""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5,
		|	""5""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6,
		|	""6""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7,
		|	""7""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8,
		|	""8""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9,
		|	""9""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	""0""
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Цифра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотни.Цифра * 100 + Десятки.Цифра * 10 + Цифры.Цифра КАК Число,
		|	Сотни.Строка + Десятки.Строка + Цифры.Строка КАК Строка
		|ПОМЕСТИТЬ Числа
		|ИЗ
		|	Цифры КАК Сотни
		|		ПОЛНОЕ СОЕДИНЕНИЕ Цифры КАК Десятки
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ Цифры КАК Цифры
		|		ПО (ИСТИНА)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Число
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ДокументПосещение КАК Посещение,
		|	&Контрагент КАК Контрагент,
		|	Числа.Строка КАК ИдентификаторЗадания,
		|	&ДокументМаршрут КАК Маршрут,
		|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания КАК ВидЗадания,
		|	ВЫБОР
		|		КОГДА ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты ЕСТЬ NULL
		|			ТОГДА ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания.Наименование
		|		ИНАЧЕ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания.Наименование + "" ("" + ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты.Наименование + "")""
		|	КОНЕЦ КАК Задание,
		|	ВЫБОР
		|		КОГДА НЕ ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты ЕСТЬ NULL
		|			ТОГДА ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты
		|		КОГДА ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных
		|			ТОГДА &ШаблонАнкетыАктуализацияКонтактныхДанных
		|		КОГДА НЕ ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты ЕСТЬ NULL
		|			ТОГДА ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)
		|	КОНЕЦ КАК ШаблонАнкеты,
		|	ВЫБОР
		|		КОГДА НЕ ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.Обязательное
		|	КОНЕЦ КАК Обязательное
		|ИЗ
		|	Справочник.ТипыПосещенийКлиентовТорговымиПредставителями.ЗаданияТорговомуПредставителю КАК ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю
		|		ЛЕВОЕ СОЕДИНЕНИЕ Числа КАК Числа
		|		ПО ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.НомерСтроки = Числа.Число
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияПоАнкетированиюКлиентов КАК ЗаданияПоАнкетированиюКлиентов
		|		ПО (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАнкета)
		|			И (ЗаданияПоАнкетированиюКлиентов.Контрагент = &Контрагент)
		|			И (ЗаданияПоАнкетированиюКлиентов.ТорговыйПредставитель = &ТорговыйПредставитель)
		|			И (ЗаданияПоАнкетированиюКлиентов.ДатаНачалаАнкетирования <= &Дата)
		|			И (ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты <> &ШаблонАнкетыАктуализацияКонтактныхДанных)
		|			И (&Дата <= КОНЕЦПЕРИОДА(ЗаданияПоАнкетированиюКлиентов.ДатаОкончанияАнкетирования, ДЕНЬ)
		|				ИЛИ ЗаданияПоАнкетированиюКлиентов.ДатаОкончанияАнкетирования = ДАТАВРЕМЯ(1, 1, 1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АнкетаТП КАК АнкетаТП
		|		ПО (НЕ ЗаданияПоАнкетированиюКлиентов.Контрагент ЕСТЬ NULL)
		|			И (АнкетаТП.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ЗаданияПоАнкетированиюКлиентов.ДатаНачалаАнкетирования, ДЕНЬ) И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), СЕКУНДА, -1))
		|			И (НЕ АнкетаТП.ПометкаУдаления)
		|			И (АнкетаТП.Контрагент = &Контрагент)
		|			И (ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты = АнкетаТП.ШаблонАнкеты)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияПоАнкетированиюКлиентов КАК ЗаданияНаАктуализациюКонтактныхДанных
		|		ПО (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных)
		|			И (ЗаданияНаАктуализациюКонтактныхДанных.Контрагент = &Контрагент)
		|			И (ЗаданияНаАктуализациюКонтактныхДанных.ТорговыйПредставитель = &ТорговыйПредставитель)
		|			И (ЗаданияНаАктуализациюКонтактныхДанных.ДатаНачалаАнкетирования <= &Дата)
		|			И (ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты = &ШаблонАнкетыАктуализацияКонтактныхДанных)
		|			И (&Дата <= ЗаданияНаАктуализациюКонтактныхДанных.ДатаОкончанияАнкетирования
		|				ИЛИ ЗаданияНаАктуализациюКонтактныхДанных.ДатаОкончанияАнкетирования = ДАТАВРЕМЯ(1, 1, 1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АнкетаТП КАК АнкетаТПНаАктуализациюКонтактныхДанных
		|		ПО (НЕ ЗаданияНаАктуализациюКонтактныхДанных.Контрагент ЕСТЬ NULL)
		|			И (АнкетаТПНаАктуализациюКонтактныхДанных.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ЗаданияНаАктуализациюКонтактныхДанных.ДатаНачалаАнкетирования, ДЕНЬ) И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), СЕКУНДА, -1))
		|			И (НЕ АнкетаТПНаАктуализациюКонтактныхДанных.ПометкаУдаления)
		|			И (АнкетаТПНаАктуализациюКонтактныхДанных.Контрагент = &Контрагент)
		|			И (ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты = АнкетаТПНаАктуализациюКонтактныхДанных.ШаблонАнкеты)
		|ГДЕ
		|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.Ссылка = &Ссылка
		|	И (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания <> &ВидЗаданияАнкета
		|				И ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания <> &ВидЗаданияАктуализацияКонтактныхДанных
		|			ИЛИ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАнкета
		|				И НЕ ЗаданияПоАнкетированиюКлиентов.Контрагент ЕСТЬ NULL
		|				И АнкетаТП.Дата ЕСТЬ NULL
		|			ИЛИ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных
		|				И НЕ ЗаданияНаАктуализациюКонтактныхДанных.Контрагент ЕСТЬ NULL
		|				И АнкетаТПНаАктуализациюКонтактныхДанных.Дата ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Числа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Цифры";
		
		Запрос.УстановитьПараметр("Ссылка", ОбщийМодульПовтИсп.ПолучитьТипВнеплановогоПосещения() );
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ДокументПосещение", Ссылка);
		Запрос.УстановитьПараметр("ДокументМаршрут", Маршрут);
		
		Запрос.УстановитьПараметр("ТорговыйПредставитель", Сотрудник.ФизЛицо);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ВидЗаданияАнкета", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Анкета"));
		Запрос.УстановитьПараметр("ВидЗаданияАктуализацияКонтактныхДанных", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных"));
		Запрос.УстановитьПараметр("ШаблонАнкетыАктуализацияКонтактныхДанных", ОбщийМодульПовтИсп.ШаблонАнкетыДляТППолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных"));
		
		Движения.ЗаданияТППоВнеплановымПосещениям.Загрузить(Запрос.Выполнить().Выгрузить());
		Движения.ЗаданияТППоВнеплановымПосещениям.Записывать = Истина;
		
	КонецЕсли;
	
	// Перепроведем маршруты, чтобы убрать из них задание на анкетирование
	Если Не Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнкетаТП.ТорговыйПредставитель,
		|	АнкетаТП.Ссылка
		|ПОМЕСТИТЬ ДокументыАнкетирования
		|ИЗ
		|	Документ.АнкетаТП КАК АнкетаТП
		|ГДЕ
		|	АнкетаТП.Посещение = &Посещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Маршрут.Ссылка КАК Маршрут
		|ИЗ
		|	Документ.Маршрут КАК Маршрут
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыАнкетирования КАК ДокументыАнкетирования
		|		ПО Маршрут.ТорговыйПредставитель = ДокументыАнкетирования.ТорговыйПредставитель
		|ГДЕ
		|	Маршрут.Дата > &Дата
		|	И Маршрут.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Маршрут
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДокументыАнкетирования";
		
		Запрос.УстановитьПараметр("Дата", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("Посещение", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			укМаршрут = ВыборкаДетальныеЗаписи.Маршрут.ПолучитьОбъект();
			укМаршрут.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Сотрудник = Константы.ТекущийПользователь.Получить();
	КонецЕсли;	
	ТорговыйПредставитель = Сотрудник.ФизЛицо;
	
КонецПроцедуры
